# Напишите программу, которая принимает на вход координаты двух точек
#  и находит расстояние между ними в 2D пространстве.


a = []
print ("Введите координаты XY точки А: ")
for i in range(2): 
    a.append(int(input()))


b = []
print ("Введите координаты XY точки B: ")
for k in range(2): 
    b.append(int(input()))

lengthAB = ((b[0] - a[0]) ** 2 + (b[1] - a[1]) ** 2) ** (0.5)
print ("Длина АВ = ", lengthAB)

