# Задача 1-1. Напишите программу, которая принимает на вход число N 
# и выдаёт последовательность из N членов.
# Пример: Для N = 5: 1, -3, 9, -27, 81


a = int (input("Задайте число:  "))
listA = []
for degree in range(a):
# заполнить массви строками значений степеней числа 3 
    listA.append(str((-3)**degree))
# вывести массив строк - разделитель и окончание
print(", ".join(listA), end= ".")


# # Задача 1-2 2. Для натурального n создать словарь индекс-значение, 
# # состоящий из элементов последовательности 3n + 1.
# Пример: Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

a = int (input("Задайте число:  "))
#  словарь = (ключ:значение для i от 1 до а+1)
dictA = {i:i*3+1 for i in range (1,a+1)}
print (dictA)

# как вариант
# dictA = {}
# for i in range (1,a+1):
#     dictA[i] = i*3+1

# # Задача 1-3 Напишите программу, в которой пользователь будет задавать
#  две строки, а программа - определять количество вхождений одной 
# строки в другой.
# ввод строк - инпут по умолчанию - СТРОКА!!!! 
s1 =  input('введите стр1 ')
s2 =  input('введите стр2 ')

# буфферные строка и подстрока - определить кто есть кто
string = ''
substring = ''

if len(s1) > len(s2):
    string = s1
    substring = s2
else:
    string = s2
    substring = s1
# метод - проверить количество подстрок в строке
print (string.count(substring))

# механика метода COUNT
count = 0
counter = 0

for i in range (len(string)- len(substring)):
    if string [i] == substring[0]:
        counterIn = 0
        for k in range(len(substring)):
            if substring [0+k] == string [i+k]:
                counterIn += 1
        if counterIn == len (substring):
            counter += 1
print(f'Counter = {counter}')


#  поиск подстроки в строке
# print (s1.find(s2))
# print (s2.find(s1))